{
    "valid-hashes": [ "home", "potato", "tomato", "corn", "cucumber" ],
    "home": {
        "icon": "/icons/broccoli-icon.svg",
        "background-image": "/backgrounds/grove.jpg",
        "title": "Tree-Eats - Healthy Snacks for Kids",
        "contents": {
            "0": [ "no-img", "Our Goal", "", "We are an organization who work towards the humble goal of feeding kids healthy, veg-based, snacks." ],
            "1": [ "left-img", "Our Website", "/elements/sapling-0.jpg", "'This website was made and developed to help raise awarness of different vegtables, and by learning about them, it is our hope kids will become encouraged to eat more of them as well.' - Founder of Tree-Eats, Non-Profit Charity" ]
        }
    },
    "potato": {
        "icon": "/icons/potato-icon.svg",
        "background-image": "/backgrounds/mushroom.jpg",
        "title": "Potatoes",
        "contents": {
            "0": [ "left-img", "Potatoes, what are they?", "/elements/potato-0.jpg", "The potato is a starchy food, a tuber of the plant Solanum tuberosum and is a root vegetable native to the Americas. The plant is a perennial in the nightshade family Solanaceae.Wild potato species can be found from the southern United States to southern Chile. The potato was originally believed to have been domesticated by Native Americans independently in multiple locations, but later genetic studies traced a single origin, in the area of present-day southern Peru and extreme northwestern Bolivia. Potatoes were domesticated there approximately 7,000–10,000 years ago, from a species in the Solanum brevicaule complex. In the Andes region of South America, where the species is indigenous, some close relatives of the potato are cultivated." ],
            "1": [ "right-img", "Where do they come from?", "/elements/potato-1.jpg", "Potatoes were introduced to Europe from the Americas by the Spanish in the second half of the 16th century. Today they are a staple food in many parts of the world and an integral part of much of the world's food supply. As of 2014, potatoes were the world's fourth-largest food crop after maize (corn), wheat, and rice. Following millennia of selective breeding, there are now over 5,000 different types of potatoes. Over 99% of potatoes presently cultivated worldwide descend from varieties that originated in the lowlands of south-central Chile. The importance of the potato as a food source and culinary ingredient varies by region and is still changing. It remains an essential crop in Europe, especially Northern and Eastern Europe, where per capita production is still the highest in the world, while the most rapid expansion in production during the 21st century was in southern and eastern Asia, with China and India leading the world production of 376 million tonnes, as of 2021." ],
            "2": [ "no-img", "Extra Information", "", "Like the tomato, the potato is a nightshade in the genus Solanum, and the vegetative and fruiting parts of the potato contain the toxin solanine which is dangerous for human consumption. Normal potato tubers that have been grown and stored properly produce glycoalkaloids in amounts small enough to be negligible for human health, but, if green sections of the plant (namely sprouts and skins) are exposed to light, the tuber can accumulate a high enough concentration of glycoalkaloids to affect human health." ]
        }
    },
    "tomato": {
        "icon": "/icons/tomato-icon.svg",
        "background-image": "/backgrounds/forest.jpg",
        "title": "Tomato",
        "contents": {
            "0": [ "no-img", "What are Tomatoes?", "", "The tomato ( or ) is the edible berry of the plant Solanum lycopersicum, commonly known as the tomato plant. The species originated in western South America, Mexico, and Central America. The Nahuatl word tomatl gave rise to the Spanish word tomate, from which the English word tomato derived. Its domestication and use as a cultivated food may have originated with the indigenous peoples of Mexico. The Aztecs used tomatoes in their cooking at the time of the Spanish conquest of the Aztec Empire, and after the Spanish encountered the tomato for the first time after their contact with the Aztecs, they brought the plant to Europe, in a widespread transfer of plants known as the Columbian exchange. From there, the tomato was introduced to other parts of the European-colonized world during the 16th century.Tomatoes are a significant source of umami flavor. They are consumed in diverse ways: raw or cooked, and in many dishes, sauces, salads, and drinks. While tomatoes are fruits—botanically classified as berries—they are commonly used culinarily as a vegetable ingredient or side dish.Numerous varieties of the tomato plant are widely grown in temperate climates across the world, with greenhouses allowing for the production of tomatoes throughout all seasons of the year. Tomato plants typically grow to 1–3 meters (3–10 ft) in height. They are vines that have a weak stem that sprawls and typically needs support. Indeterminate tomato plants are perennials in their native habitat, but are cultivated as annuals. (Determinate, or bush, plants are annuals that stop growing at a certain height and produce a crop all at once.) The size of the tomato varies according to the cultivar, with a range of 1–10 cm (1⁄2–4 in) in width." ],
            "1": [ "right-img", "Their History", "/elements/tomato-0.jpg", "The wild ancestor of the tomato, Solanum pimpinellifolium, is native to western South America. These wild versions were the size of peas. The first evidence of domestication points to the Aztecs and other peoples in Mesoamerica, who used the fruit fresh and in their cooking. The Spanish first introduced tomatoes to Europe, where they became used in Spanish food. In France, Italy and northern Europe, the tomato was initially grown as an ornamental plant. It was regarded with suspicion as a food because botanists recognized it as a nightshade, a relative of the poisonous belladonna. This was exacerbated by the interaction of the tomato's acidic juice with pewter plates. The leaves and fruit contain tomatine, which in large quantities would be toxic. However, the ripe fruit contains a much lower amount of tomatine than the immature fruit." ],
            "2": [ "left-img", "The Italians", "/elements/tomato-1.jpg", "The recorded history of tomatoes in Italy dates back to at least 31 October 1548, when the house steward of Cosimo de' Medici, the grand duke of Tuscany, wrote to the Medici private secretary informing him that the basket of tomatoes sent from the grand duke's Florentine estate at Torre del Gallo 'had arrived safely'. Tomatoes were grown mainly as ornamentals early on after their arrival in Italy. For example, the Florentine aristocrat Giovanvettorio Soderini wrote how they 'were to be sought only for their beauty', and were grown only in gardens or flower beds. The tomato's ability to mutate and create new and different varieties helped contribute to its success and spread throughout Italy. However, even in areas where the climate supported growing tomatoes, their habit of growing to the ground suggested low status. They were not adopted as a staple of the peasant population because they were not as filling as other fruits already available. Additionally, both toxic and inedible varieties discouraged many people from attempting to consume or prepare any other varieties. In certain areas of Italy, such as Florence, the fruit was used solely as a tabletop decoration, until it was incorporated into the local cuisine in the late 17th or early 18th century. The earliest discovered cookbook with tomato recipes was published in Naples in 1692, though the author had apparently obtained these recipes from Spanish sources.: 17 Unique varieties were developed over the next several hundred years for uses such as dried tomatoes, sauce tomatoes, pizza tomatoes, and tomatoes for long-term storage. These varieties are usually known for their place of origin as much as by a variety name. For example, Pomodorino del Piennolo del Vesuvio is the 'hanging tomato of Vesuvius', or the well known and highly-prized San Marzano plum tomato grown in that region." ]
        }
    },
    "corn": {
        "icon": "/icons/corn-icon.svg",
        "background-image": "/backgrounds/leaves.jpg",
        "title": "Corn",
        "contents": {
            "0": [ "left-img", "Corn... or Maize?", "/elements/corn-0.jpg", "Maize ( MAYZ; Zea mays subsp. mays, from Spanish: maíz after Taino: mahis), also known as corn in North American and Australian English, is a cereal grain first domesticated by indigenous peoples in southern Mexico about 10,000 years ago. The leafy stalk of the plant produces pollen inflorescences (or 'tassels') and separate ovuliferous inflorescences called ears that when fertilized yield kernels or seeds, which are fruits. The term maize is preferred in formal, scientific, and international usage as the common name because this refers specifically to this one grain whereas corn refers to any principal cereal crop cultivated in a country. For example, in North America and Australia corn is often used for maize, but in England and Wales it can refer to wheat or barley, and in Scotland and Ireland to oats." ],
            "1": [ "no-img", "More Info.", "", "Maize has become a staple food in many parts of the world, with the total production of maize surpassing that of wheat or rice. In addition to being consumed directly by humans (often in the form of masa), maize is also used for corn ethanol, animal feed and other maize products, such as corn starch and corn syrup. The six major types of maize are dent corn, flint corn, pod corn, popcorn, flour corn, and sweet corn. Sugar-rich varieties called sweet corn are usually grown for human consumption as kernels, while field corn varieties are used for animal feed, various corn-based human food uses (including grinding into cornmeal or masa, pressing into corn oil, fermentation and distillation into alcoholic beverages like bourbon whiskey), and as feedstocks for the chemical industry. Maize is also used in making ethanol and other biofuels." ],
            "2": [ "right-img", "Production", "/elements/corn-1.jpg", "Maize is widely cultivated throughout the world, and a greater weight of maize is produced each year than any other grain. In 2021, total world production was 1.2 billion tonnes. Maize is the most widely grown grain crop throughout the Americas, with 384 million metric tons grown in the United States alone in 2021. Genetically modified maize made up 85% of the maize planted in the United States in 2009. Subsidies in the United States help to account for its high level of cultivation of maize and its position as the largest producer in the world." ]
        }
    },
    "cucumber": {
        "icon": "/icons/cucumber-icon.svg",
        "background-image": "/backgrounds/forest.jpg",
        "title": "Cucumber",
        "contents": {
            "0": [ "no-img", "The Humble Cucumber", "", "The cucumber (Cucumis sativus) is a widely-cultivated creeping vine plant in the family Cucurbitaceae that bears cylindrical to spherical fruits, which are used as culinary vegetables. Considered an annual plant, there are three main types of cucumber—slicing, pickling, and seedless—within which several cultivars have been created. The cucumber originates from Himalaya to China (Yunnan, Guizhou, Guangxi) and N. Thailand, but now grows on most continents, and many different types of cucumber are grown commercially and traded on the global market. In North America, the term wild cucumber refers to plants in the genera Echinocystis and Marah, though the two are not closely related." ],
            "1": [ "left-img", "Description", "/elements/cucumber-0.jpg", "The cucumber is a creeping vine that roots in the ground and grows up trellises or other supporting frames, wrapping around supports with thin, spiraling tendrils. The plant may also root in a soilless medium, whereby it will sprawl along the ground in lieu of a supporting structure. The vine has large leaves that form a canopy over the fruits.The fruit of typical cultivars of cucumber is roughly cylindrical, but elongated with tapered ends, and may be as large as 62 centimeters (24 in) long and 10 centimeters (4 in) in diameter.Cucumber fruits consist of 95% water (see nutrition table). In botanical terms, the cucumber is classified as a pepo, a type of botanical berry with a hard outer rind and no internal divisions. However, much like tomatoes and squashes, it is often perceived, prepared, and eaten as a vegetable." ],
            "2": [ "right-img", "Pollination", "/elements/cucumber-1.jpg", "Most cucumber cultivars are seeded and require pollination. For this purpose, thousands of honey beehives are annually carried to cucumber fields just before bloom. Cucumbers may also be pollinated via bumblebees and several other bee species. Most cucumbers that require pollination are self-incompatible, thus requiring the pollen of another plant in order to form seeds and fruit. Some self-compatible cultivars exist that are related to the 'Lemon cucumber' cultivar.A few cultivars of cucumber are parthenocarpic, the blossoms of which create seedless fruit without pollination, which degrades the eating quality of these cultivar. In the United States, these are usually grown in greenhouses, where bees are excluded. In Europe, they are grown outdoors in some regions, where bees are likewise excluded.Traditional cultivars produce male blossoms first, then female, in about equivalent numbers. Newer gynoecious hybrid cultivars produce almost all female blossoms. They may have a pollenizer cultivar interplanted, and the number of beehives per unit area is increased, but temperature changes induce male flowers even on these plants, which may be sufficient for pollination to occur.In 2009, an international team of researchers announced they had sequenced the cucumber genome." ]
        }
    }
}